app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("user_name", "first_name", "last_name", "doctor_liscense", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_doctor
      @doctor = Doctor.find(params[:id])