app/controllers/patients_controller.rb

INSERT INTO "patients" ("user_name", "first_name", "last_name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save

UPDATE "patients" SET "user_name" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["user_name", "liamhur"], ["updated_at", 2016-11-30 23:37:40 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @patient.update(patient_params)

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_patient
      @patient = Patient.find(params[:id])